# -*- coding: utf-8 -*-

#
# Представление числа
#

# При обычном определении числовой переменной она получает значение в 
# десятичной системе. Но кроме десятичной в Python мы можем использовать 
# двоичную, восьмеричную и шестнадцатеричную системы.

# Для определения числа в двоичной системе перед его значением ставится 0 и префикс b:
x = 0b101   # 101 в двоичной системе равно 5

# Для определения числа в восьмеричной системе перед его значением ставится 0 и префикс o:
a = 0o11    # 11 в восьмеричной системе равно 9

# Для определения числа в шестнадцатеричной системе перед его значением ставится 0 и префикс x:
y = 0x0a    # a в шестнадцатеричной системе равно 10

# И с числами в других системах измерения также можно проводить арифметические операции:
x = 0b101   # 5
y = 0x0a    # 10
z = x + y   # 15
print("{0} in binary {0:08b} in hex {0:02x} in octal {0:02o}".format(z))