# -*- coding: utf-8 -*-

#
# Сравнения строк
#

# Особо следует сказать о сравнении строк. При сравнении строк 
# принимается во внимание символы и их регистр. Так, цифровой 
# символ условно меньше, чем любой алфавитный символ. Алфавитный 
# символ в верхнем регистре условно меньше, чем алфавитные 
# символы в нижнем регистре. Например:

str1 = "1a"
str2 = "aa"
str3 = "Aa"
print(str1 > str2)  # False, так как первый символ в str1 - цифра
print(str2 > str3)  # True, так как первый символ в str2 - в нижнем регистре

# Поэтому строка "1a" условно меньше, чем строка "aa". 
# Вначале сравнение идет по первому символу. Если начальные 
# символы обоих строк представляют цифры, то меньшей считается 
# меньшая цифра, например, "1a" меньше, чем "2a".

# Если начальные символы представляют алфавитные символы в 
# одном и том же регистре, то смотрят по алфавиту. 
# Так, "aa" меньше, чем "ba", а "ba" меньше, чем "ca".

# Если первые символы одинаковые, в расчет берутся 
# вторые символы при их наличии.

# Зависимость от регистра не всегда желательна, так как 
# по сути мы имеем дело с одинаковыми строками. В этом 
# случае перед сравнением мы можем привести обе строки 
# к одному из регистров.

# Функция lower() приводит строку к нижнему регистру, 
# а функция upper() - к верхнему.
	
str1 = "Tom"
str2 = "tom"
print(str1 == str2)  # False - строки не равны
 
print(str1.lower() == str2.lower())  # True