#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Условная конструкция if
#

# Условные конструкции используют условные выражения и в зависимости
# от их значения направляют выполнение программы по одному из путей.
# Одна из таких конструкций - это конструкция if.
# Она имеет следующее формальное определение:

# if логическое_выражение:
#     инструкции
# [elif логическое выражение:
#     инструкции]
# [else:
#     инструкции]

#! Программа Обменный пункт

usd = 57
euro = 60

money = int(input("Введите сумму, которую вы хотите обменять: "))
currency = int(input("Укажите код валюты (доллары - 400, евро - 401): "))

if currency == 400:
    cash = round(money / usd, 2)
    print("Валюта: доллары США")
elif currency == 401:
    cash = round(money / euro, 2)
    print("Валюта: евро")
else:
    cash = 0
    print("Неизвестная валюта")

print("К получению:", cash)

# С помощью функции input() получаем вводимые пользователем данные на консоль.
# Причем данная функция возвращает данные в виде строки, поэтому нам надо ее
# еще привести к целому числу с помощью функции int(), чтобы введенные данные
# можно было использовать в арифметических операциях.
