#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Цикл while
#

# Цикл while имеет следующее формальное определение:
	
# while условное_выражение:
#    инструкции

# После ключевого слова while указывается условное выражение, 
# и пока это выражение возвращает значение True, будет 
# выполняться блок инструкций, который идет далее.

# Все инструкции, которые относятся к циклу while, 
# располагаются на последующих строках и должны иметь 
# отступ от начала строки.

choice = "y"
 
while choice.lower() == "y":
    print("Привет")
    choice = input("Для продолжения нажмите Y, а для выхода любую другую клавишу: ")
print("Работа программы завешена")

# В данном случае цикл while будет продолжаться, пока 
# переменная choice содержит латинскую букву "Y" или "y".

# Вычисление факториала:
 
number = int(input("Введите число: "))
i = 1
factorial = 1
while i <= number:
    factorial *= i
    i += 1
print("Факториал числа", number, "равен", factorial)

# Здесь вводит с консоли некоторое число, и пока 
# число-счетчик i не будет больше введенного числа, 
# будет выполняться цикл, в котором происходит 
# умножения числа factorial.