#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Цикл for
#

# Цикл for вызывается для каждого числа в некоторой коллекции чисел.
# Коллекция чисел создается с помощью функции range().
# Формальное определение цикла for:

# for int_var in функция_range:
#     инструкции

# Программа по вычислению факториала

number = int(input("Введите число: "))
factorial = 1
for i in range(1, number+1):
    factorial *= i
print("Факториал числа", number, "равен", factorial)

# Функция range имеет следующие формы:
#
#   range(stop)              : возвращает все целые числа от 0 до stop
#
#   range(start, stop)       : возвращает все целые числа в промежутке
#                              от start (включая) до stop (не включая).
#                              Выше в программе факториала использована
#                              именно эта форма.

#   range(start, stop, step) : возвращает целые числа в промежутке от
#                              start (включая) до stop (не включая),
#                              которые увеличиваются на значение step

# Примеры вызовов функции range:
range(5)            # 0, 1, 2, 3, 4
range(1, 5)         # 1, 2, 3, 4
range(2, 10, 2)     # 2, 4, 6, 8
range(5, 0, -1)     # 5, 4, 3, 2, 1

# Например, выведем последовательно все числа от 0 до 4:
for i in range(5):
    print(i, end=", ")

print('\n')
