#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Списки: создание, перебор, обращенин, сравнение
#

# Список (list) представляет тип данных, который хранит набор
# или последовательность элементов. Для создания списка в
# квадратных скобках ([]) через запятую перечисляются все его
# элементы. Во многих языках программирования есть аналогичная
# структура данных, которая называется массив.

numbers = [1, 2, 3, 4, 5]

# Также для создания списка можно использовать конструктор list():

numbers1 = []
numbers2 = list()

# Конструктор list для создания списока может принимать другой список:

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
numbers2 = list(numbers)

# Если необходимо создать список, в котором повторяется одно и то
# же значение несколько раз

numbers = [5] * 6  # [5, 5, 5, 5, 5, 5]
print(numbers)

# Если нам необходим последовательный список чисел, то для его
# создания удобно использовать функцию range, которая имеет три формы:
#   range(end)              : создается набор чисел от 0 до числа end
#   range(start, end)       : создается набор чисел от числа start до числа end
#   range(start, end, step) : создается набор чисел от числа start до числа end с шагом step

numbers = list(range(10))
print(numbers)      # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
numbers = list(range(2, 10))
print(numbers)      # [2, 3, 4, 5, 6, 7, 8, 9]
numbers = list(range(10, 2, -2))
print(numbers)      # [10, 8, 6, 4]

# Для обращения к элементам списка надо использовать индексы,
# которые представляют номер элемента в списка. Индексы начинаются
# с нуля. То есть второй элемент будет иметь индекс 1. Для обращения
# к элементам с конца можно использовать отрицательные индексы,
# начиная с -1. То есть у последнего элемента будет индекс -1,
# у предпоследнего - -2 и так далее.

numbers = [1, 2, 3, 4, 5]
print(numbers[0])   # 1
print(numbers[2])   # 3
print(numbers[-3])  # 3

numbers[0] = 125    # изменяем первый элемент списка
print(numbers[0])   # 125

# Перебор элементов

# Перебор с помощью цикла for:
companies = ["Microsoft", "Google", "Oracle", "Apple"]
for item in companies:
    print(item)

# Перебор с помощью цикла while:
companies = ["Microsoft", "Google", "Oracle", "Apple"]
i = 0
while i < len(companies):
    print(companies[i])
    i += 1

# Сравнение списков
# Два списка считаются равными, если они содержат один и тот же набор элементов:
	
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
numbers2 = list(range(1,10))
if numbers == numbers2:
    print("numbers equal to numbers2")
else:
    print("numbers is not equal to numbers2")
