#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Запись в текстовый файл
#

# Чтобы открыть текстовый файл на запись, необходимо применить режим 
# w (перезапись) или a (дозапись). Затем для записи применяется метод
#  write(str), в который передается записываемая строка. Стоит 
# отметить, что записывается именно строка, поэтому, если нужно 
# записать числа, данные других типов, то их предварительно нужно 
# конвертировать в строку.

# Запишем некоторую информацию в файл "hello.txt":
	
with open("hello.txt", "w") as file:
    file.write("hello world")

# Теперь дозапишем в этот файл еще одну строку:
	
with open("hello.txt", "a") as file:
    file.write("\ngood bye, world")

# Дозапись выглядит как добавление строку к последнему символу в 
# файле, поэтому, если необходимо сделать запись с новой строки, 
# то можно использовать эскейп-последовательность "\n". 
# В итоге файл hello.txt будет иметь следующее содержимое:
	
#   hello world
#   good bye, world

# Еще один способ записи в файл представляет стандартный метод 
# print(), который применяется для вывода данных на консоль:
	
with open("hello.txt", "a") as hello_file:
    print("\nHello, world", file=hello_file)

# Для вывода данных в файл в метод print в качестве второго 
# параметра передается название файла через параметр file. 
# А первый параметр представляет записываемую в файл строку.

print("Файл 'hello.txt' изменен!")