#!/usr/bin/python3
# -*- coding: utf-8 -*-

#
# Модуль OS и работа с файловой системой
#

# Ряд возможностей по работе с каталогами и файлами предоставляет
# встроенный модуль os. Хотя он содержит много функций, рассмотрим
# только основные из них:
#
#     mkdir()   : создает новую папку
#     rmdir()   : удаляет папку
#     rename()  : переименовывает файл
#     remove()  : удаляет файл

#####################################################################
# Создание и удаление папки

# Для создания папки применяется функция mkdir(), в которую
# передается путь к создаваемой папке:

import os

# путь относительно текущего скрипта
os.mkdir("hello")
# абсолютный путь
# os.mkdir("c://somedir")
# os.mkdir("c://somedir/hello")

# Для удаления папки используется функция rmdir(), в которую
# передается путь к удаляемой папке:


# путь относительно текущего скрипта
os.rmdir("hello")
# абсолютный путь
# os.rmdir("c://somedir/hello")

#####################################################################
# Существование файла

# Если мы попытаемся открыть файл, который не существует, то Python
# выбросит исключение FileNotFoundError. Для отлова исключения мы
# можем использовать конструкцию try...except. Однако можно уже до
# открытия файла проверить, существует ли он или нет с помощью
# метода os.path.exists(path). В этот метод передается путь, который
# необходимо проверить:

# filename = input("Введите путь к файлу: ")
filename = 'hello.txt'
if os.path.exists(filename):
    print("Файл %r существует" % filename)
else:
    print("Файл %r не существует, создадим его..." % filename)
    with open(filename, "w") as file:
        file.write("hello world")
        print('Файл создан!')

#####################################################################
# Переименование файла

# Для переименования вызывается функция rename(source, target),
# первый параметр которой - путь к исходному файлу,
# а второй - новое имя файла. В качестве путей могут использоваться
# как абсолютные, так и относительные. Например, пусть в папке
# C://SomeDir/ располагается файл somefile.txt. Переименуем его в
# файл "hello.txt":

# путь относительно текущего скрипта
os.rename("hello.txt", "hello.bak")
# абсолютный путь
# os.rename("C://SomeDir/somefile.txt", "C://SomeDir/hello.txt")

#####################################################################
# Удаление файла

# Для удаления вызывается функция remove(), в которую передается путь
# к файлу:

os.remove("hello.bak")


